In [1]:
import pandas as pd
import numpy as np

In [2]:
import os
cwd = os.getcwd()
print(cwd)

/Users/rosamund/Documents/GitHub/CO2-age-group

## Create list of files will need to export

In [3]:
files = os.listdir(cwd + '/data/')

print(files)
print(len(files))

['Germany_2.6_national.csv', 'France_2.6_global.csv', 'Canada_2.6_national.csv', 'India_1.9_national.csv', 'Ethiopia_1.9_national.csv', 'Indonesia_1.9_national.csv', 'Ethiopia_2.6_global.csv', 'Philippines_1.9_global.csv', 'Australia_2.6_national.csv', 'Indonesia_1.9_global.csv', 'Mexico_1.9_global.csv', 'LATIN AMERICA AND THE CARIBBEAN_1.9_national.csv', 'United Kingdom_1.9_global.csv', '.DS_Store', 'Spain_2.6_global.csv', 'China_2.6_global.csv', 'Russian Federation_1.9_global.csv', 'Philippines_1.9_national.csv', 'United Kingdom_2.6_national.csv', 'Italy_2.6_national.csv', 'ASIA_2.6_global.csv', 'Egypt_1.9_global.csv', 'Egypt_1.9_national.csv', 'Brazil_1.9_national.csv', 'Australia_2.6_global.csv', 'Germany_2.6_global.csv', 'AFRICA_1.9_national.csv', 'OCEANIA_1.9_national.csv', 'ASIA_2.6_national.csv', 'LATIN AMERICA AND THE CARIBBEAN_1.9_global.csv', 'Nigeria_1.9_global.csv', 'France_1.9_national.csv', 'India_2.6_global.csv', 'Canada_2.6_global.csv', 'Bangladesh_1.9_national.csv', 'Argentina_2.6_national.csv', 'Viet Nam_1.9_global.csv', 'Japan_1.9_global.csv', 'EUROPE_2.6_global.csv', 'United States of America_2.6_global.csv', 'Japan_1.9_national.csv', 'Italy_2.6_global.csv', 'Russian Federation_2.6_national.csv', 'Nigeria_2.6_national.csv', 'Pakistan_2.6_global.csv', 'Brazil_1.9_global.csv', 'EUROPE_1.9_national.csv', 'Spain_1.9_national.csv', 'China_1.9_national.csv', 'Bangladesh_2.6_global.csv', 'United States of America_1.9_national.csv', 'AFRICA_2.6_global.csv', 'OCEANIA_1.9_global.csv', 'Argentina_2.6_global.csv', 'Mexico_2.6_national.csv', 'Pakistan_1.9_national.csv', 'Viet Nam_1.9_national.csv', 'Philippines_2.6_global.csv', 'Ethiopia_1.9_global.csv', 'Argentina_1.9_national.csv', 'Japan_2.6_national.csv', 'Mexico_2.6_global.csv', 'Russian Federation_1.9_national.csv', 'Indonesia_2.6_global.csv', 'Nigeria_1.9_national.csv', 'France_1.9_global.csv', 'France_2.6_national.csv', 'Bangladesh_2.6_national.csv', 'China_2.6_national.csv', 'Australia_1.9_global.csv', 'United States of America_2.6_national.csv', 'Egypt_2.6_global.csv', 'ASIA_1.9_global.csv', 'Mexico_1.9_national.csv', 'Pakistan_2.6_national.csv', 'Germany_1.9_global.csv', 'Viet Nam_2.6_national.csv', 'United Kingdom_2.6_global.csv', 'Spain_1.9_global.csv', 'China_1.9_global.csv', 'EUROPE_2.6_national.csv', 'Russian Federation_2.6_global.csv', 'Spain_2.6_national.csv', '.ipynb_checkpoints', 'Ethiopia_2.6_national.csv', 'Indonesia_2.6_national.csv', 'EUROPE_1.9_global.csv', 'Viet Nam_2.6_global.csv', 'Japan_2.6_global.csv', 'Australia_1.9_national.csv', 'LATIN AMERICA AND THE CARIBBEAN_2.6_national.csv', 'Italy_1.9_global.csv', 'United States of America_1.9_global.csv', 'Germany_1.9_national.csv', 'Nigeria_2.6_global.csv', 'LATIN AMERICA AND THE CARIBBEAN_2.6_global.csv', 'India_1.9_global.csv', 'Canada_1.9_national.csv', 'Canada_1.9_global.csv', 'India_2.6_national.csv', 'Bangladesh_1.9_global.csv', 'Italy_1.9_national.csv', 'United Kingdom_1.9_national.csv', 'Egypt_2.6_national.csv', 'Brazil_2.6_national.csv', 'AFRICA_1.9_global.csv', 'OCEANIA_2.6_global.csv', 'Argentina_1.9_global.csv', 'AFRICA_2.6_national.csv', 'OCEANIA_2.6_national.csv', 'ASIA_1.9_national.csv', 'Pakistan_1.9_global.csv', 'Brazil_2.6_global.csv', 'Philippines_2.6_national.csv']
114

In [11]:
charts = []

for x in files:
    if "_2.6" in x:
        y = x.replace("_2.6", "")
        z = y.replace(".csv", "")
        charts.append(z)
        
print(charts)
print(len(charts))

['Germany_national', 'France_global', 'Canada_national', 'Ethiopia_global', 'Australia_national', 'Spain_global', 'China_global', 'United Kingdom_national', 'Italy_national', 'ASIA_global', 'Australia_global', 'Germany_global', 'ASIA_national', 'India_global', 'Canada_global', 'Argentina_national', 'EUROPE_global', 'United States of America_global', 'Italy_global', 'Russian Federation_national', 'Nigeria_national', 'Pakistan_global', 'Bangladesh_global', 'AFRICA_global', 'Argentina_global', 'Mexico_national', 'Philippines_global', 'Japan_national', 'Mexico_global', 'Indonesia_global', 'France_national', 'Bangladesh_national', 'China_national', 'United States of America_national', 'Egypt_global', 'Pakistan_national', 'Viet Nam_national', 'United Kingdom_global', 'EUROPE_national', 'Russian Federation_global', 'Spain_national', 'Ethiopia_national', 'Indonesia_national', 'Viet Nam_global', 'Japan_global', 'LATIN AMERICA AND THE CARIBBEAN_national', 'Nigeria_global', 'LATIN AMERICA AND THE CARIBBEAN_global', 'India_national', 'Egypt_national', 'Brazil_national', 'OCEANIA_global', 'AFRICA_national', 'OCEANIA_national', 'Brazil_global', 'Philippines_national']
56

## Attempt to loop process

In [18]:
for x in charts:
    #split x into array for country and national/global
    y = x.split("_")
    df1 = pd.read_csv((cwd + "/data/" + y[0] + "_2.6_" + y[1] + ".csv"))
    df1_2 = df1.rename(index=str, columns={"ages": "ages", "birth_year": "birth_year", "budget": "two"})
    df2 = pd.read_csv((cwd + "/data/" + y[0] + "_1.9_" + y[1] + ".csv"))
    df2_2 = df2.drop(["Unnamed: 0"], axis=1)
    df2_3 = df2_2.rename(index=str, columns={"ages": "ages", "birth_year": "birth_year", "budget": "onepointfive"})
    df2_3['two'] = df1_2['two']
    df2_3.to_csv('new-data2/' + x + '.csv', index=False)

## Run merge on single example

In [15]:
df1 = pd.read_csv((cwd + "/AFRICA_1.9_global.csv"))

df1.head(3)

   Unnamed: 0  ages  birth_year     budget
0           0     0        2017  45.658404
1           1     1        2016  46.828467
2           2     2        2015  49.173350

In [17]:
df1_2 = df1.drop(["Unnamed: 0"], axis=1)

df1_2.head(3)

   ages  birth_year     budget
0     0        2017  45.658404
1     1        2016  46.828467
2     2        2015  49.173350

In [19]:
df1_3 = df1_2.rename(index=str, columns={"ages": "ages", "birth_year": "birth_year", "budget": "global"})

df1_3.head(3)

   ages  birth_year     global
0     0        2017  45.658404
1     1        2016  46.828467
2     2        2015  49.173350

In [20]:
df2 = pd.read_csv((cwd + "/AFRICA_1.9_national.csv"))
df2.head(3)

   Unnamed: 0  ages  birth_year     budget
0           0     0        2017  13.128090
1           1     1        2016  14.298154
2           2     2        2015  15.478373

In [21]:
df2_2 = df2.drop(["Unnamed: 0"], axis=1)

df2_2.head(3)

   ages  birth_year     budget
0     0        2017  13.128090
1     1        2016  14.298154
2     2        2015  15.478373

In [22]:
df2_3 = df2_2.rename(index=str, columns={"ages": "ages", "birth_year": "birth_year", "budget": "national"})

df2_3.head(3)

   ages  birth_year   national
0     0        2017  13.128090
1     1        2016  14.298154
2     2        2015  15.478373

In [23]:
df2_3['global'] = df1_3['global']

df2_3.head(3)

   ages  birth_year   national     global
0     0        2017  13.128090  45.658404
1     1        2016  14.298154  46.828467
2     2        2015  15.478373  49.173350